Catalogs/СтатьиРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СтатьиРасходов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КатегорияРасходовПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПравилаВеденияАналитик</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДвижения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>6</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяАналитики</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиАналитики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СтатьиРасходов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
    //
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов
//                                 справочника РолиИсполнителей.
//  ТабличныеЧасти - Структура - описание табличных частей объекта, где:
//   * Ключ - Строка - имя табличной части;
//   * Значение - ТаблицаЗначений - табличная часть в виде таблицы значений, структуру которой
//                                  необходимо скопировать перед заполнением.
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Неучтенное";
	Элемент.КатегорияРасходовПоУмолчанию = Справочники.КатегорииРасходов.ПоУмолчанию;
КонецПроцедуры

// Возвращает используемую по умолчанию категорию расходов
//
// Параметры:
//  СтатьяРасходов - СправочникСсылка.СтатьиРасходов -
//
// Возвращаемое значение:
//  СправочникСсылка.КатегорииРасходов -
Функция КатегорияРасходовПоУмолчанию(СтатьяРасходов) Экспорт
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтатьяРасходов, "КатегорияРасходовПоУмолчанию");
КонецФункции

// Инициализирует объект значениями по умолчанию
//
// Параметры:
//  Объект - СправочникОбъект.СтатьиРасходов, ДанныеФормыСтруктура -
Процедура ЗаполнитьНовыйОбъект(Объект) Экспорт
	Объект.КатегорияРасходовПоУмолчанию = Константы.КатегорияРасходовДляНовыхСтатейРасходов.Получить();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьСписокПравилВеденияАналитикСтатьямиПоВсемРасходам(Таблица)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатьиАналитики.Ссылка КАК СтатьяАналитики,
		|	СтатьиАналитики.ВидДвиженияДляВсехРасходов КАК ВидДвижения
		|ИЗ
		|	Справочник.СтатьиАналитики КАК СтатьиАналитики
		|ГДЕ
		|	НЕ СтатьиАналитики.ПометкаУдаления
		|	И СтатьиАналитики.ВидДвиженияДляВсехРасходов <> """"";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрТаблица = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(СтрТаблица, Выборка);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
